---
kind: method
id: M:Autodesk.Revit.DB.ColorOptions.Dispose
source: html/c978e3f8-24d7-9657-ce87-85cad38cbf93.htm
---
# Autodesk.Revit.DB.ColorOptions.Dispose Method

Releases all resources used by the ColorOptions

## Syntax (C#)
```csharp
public void Dispose()
```